# -*- mode: org; mode: auto-fill -*-
#+title:        Smoke test
#+startup:      showeverything

** Nginx

*** Create Nginx

Create a Nginx pod from the =nginx= docker image exposing the port 80 and set it to have 3 replicas.

#+BEGIN_SRC sh :results output :exports both
kubectl run nginx --image=nginx --port=80 --replicas=3
#+END_SRC

#+RESULTS:
: deployment "nginx" created

**** Confirm

#+BEGIN_SRC sh :results output :exports both
echo '--- default'
kubectl get svc,pods,deployments,nodes -o wide

echo 
echo '--- kube-system'
kubectl get svc,pods,deployments,nodes -o wide --namespace kube-system
echo 
echo 
#+END_SRC

#+RESULTS:
#+begin_example
--- default
NAME                     CLUSTER-IP   EXTERNAL-IP   PORT(S)      AGE         SELECTOR
kubernetes               10.32.0.1    <none>        443/TCP      9d          <none>
NAME                     READY        STATUS        RESTARTS     AGE         IP           NODE
nginx-2032906785-2esi5   1/1          Running       0            2m          10.200.2.3   worker2
nginx-2032906785-q3rk3   1/1          Running       0            2m          10.200.1.2   worker1
nginx-2032906785-zdaob   1/1          Running       0            2m          10.200.0.3   worker0
NAME                     DESIRED      CURRENT       UP-TO-DATE   AVAILABLE   AGE
nginx                    3            3             3            3           2m
NAME                     STATUS       AGE
worker0                  Ready        9d
worker1                  Ready        3d
worker2                  Ready        3d


--- kube-system
NAME                           CLUSTER-IP   EXTERNAL-IP   PORT(S)         AGE         SELECTOR
kube-dns                       10.32.0.10   <none>        53/UDP,53/TCP   19h         k8s-app=kube-dns
NAME                           READY        STATUS        RESTARTS        AGE         IP           NODE
kube-dns-v19-965658604-11x0e   3/3          Running       0               18h         10.200.0.2   worker0
kube-dns-v19-965658604-qewo9   3/3          Running       0               18h         10.200.2.2   worker2
NAME                           DESIRED      CURRENT       UP-TO-DATE      AVAILABLE   AGE
kube-dns-v19                   2            2             2               2           18h
NAME                           STATUS       AGE
worker0                        Ready        9d
worker1                        Ready        3d
worker2                        Ready        3d


#+end_example

*** Expose Nginx as NodePort

#+BEGIN_SRC sh :results output :exports both
kubectl expose deployment nginx --type NodePort
#+END_SRC

#+RESULTS:
: service "nginx" exposed

#+BEGIN_QUOTE
Note that --type=LoadBalancer will not work because we did not
configure a cloud provider when bootstrapping this cluster.
#+END_QUOTE

**** Confirm

We can now see that =nginx= has been allocated a =ClusterIP= on which
it can receive requests.

#+BEGIN_SRC sh :results output :exports both
echo '--- default'
kubectl get svc,pods,deployments,nodes -o wide
echo 
echo 
echo '--- kube-system'
kubectl get svc,pods,deployments,nodes -o wide --namespace kube-system
echo 
echo 
#+END_SRC

#+RESULTS:
#+begin_example
--- default
NAME                     CLUSTER-IP    EXTERNAL-IP   PORT(S)      AGE         SELECTOR
kubernetes               10.32.0.1     <none>        443/TCP      10d         <none>
nginx                    10.32.0.209   <nodes>       80/TCP       44s         run=nginx
NAME                     READY         STATUS        RESTARTS     AGE         IP           NODE
nginx-2032906785-2esi5   1/1           Running       0            1d          10.200.2.3   worker2
nginx-2032906785-q3rk3   1/1           Running       0            1d          10.200.1.2   worker1
nginx-2032906785-zdaob   1/1           Running       0            1d          10.200.0.3   worker0
NAME                     DESIRED       CURRENT       UP-TO-DATE   AVAILABLE   AGE
nginx                    3             3             3            3           1d
NAME                     STATUS        AGE
worker0                  Ready         10d
worker1                  Ready         4d
worker2                  Ready         4d


--- kube-system
NAME                           CLUSTER-IP   EXTERNAL-IP   PORT(S)         AGE         SELECTOR
kube-dns                       10.32.0.10   <none>        53/UDP,53/TCP   1d          k8s-app=kube-dns
NAME                           READY        STATUS        RESTARTS        AGE         IP           NODE
kube-dns-v19-965658604-11x0e   3/3          Running       0               1d          10.200.0.2   worker0
kube-dns-v19-965658604-qewo9   3/3          Running       0               1d          10.200.2.2   worker2
NAME                           DESIRED      CURRENT       UP-TO-DATE      AVAILABLE   AGE
kube-dns-v19                   2            2             2               2           1d
NAME                           STATUS       AGE
worker0                        Ready        10d
worker1                        Ready        4d
worker2                        Ready        4d


#+end_example

*** Grab the =NodePort= to create a Firewall Rule

We need to inspect the state of the =Service= which was created for
the =Nginx= pod to receive requests in order to figure out which is
the port which was dynamically allocated to it.

#+BEGIN_SRC sh :results output :exports both
kubectl get svc nginx --output=json
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
{
    "kind": "Service",
    "apiVersion": "v1",
    "metadata": {
        "name": "nginx",
        "namespace": "default",
        "selfLink": "/api/v1/namespaces/default/services/nginx",
        "uid": "c2631c91-8282-11e6-bf0b-42010af00014",
        "resourceVersion": "1119205",
        "creationTimestamp": "2016-09-24T18:14:40Z",
        "labels": {
            "run": "nginx"
        }
    },
    "spec": {
        "ports": [
            {
                "protocol": "TCP",
                "port": 80,
                "targetPort": 80,
                "nodePort": 32013
            }
        ],
        "selector": {
            "run": "nginx"
        },
        "clusterIP": "10.32.0.209",
        "type": "NodePort",
        "sessionAffinity": "None"
    },
    "status": {
        "loadBalancer": {}
    }
}
#+END_SRC

We can traverse the json above by using the =jsonpath= output.

#+BEGIN_SRC sh :results output
kubectl get svc nginx --output=jsonpath='{range .spec.ports[0]}{.nodePort}'
#+END_SRC

#+RESULTS:
: 32013

*** Create the Firewall rule

#+BEGIN_SRC sh :results output :exports both
gcloud compute firewall-rules create kubernetes-nginx-service \
  --allow=tcp:32013 \
  --network kubernetes
#+END_SRC

#+RESULTS:
: NAME                      NETWORK     SRC_RANGES  RULES      SRC_TAGS  TARGET_TAGS
: kubernetes-nginx-service  kubernetes  0.0.0.0/0   tcp:32013

Now if we grab any of the worker nodes and send a request to it in
this port, we will see that all of them reply with =200 OK=.

#+BEGIN_SRC sh :results output :exports both
gcloud compute instances list | grep worker | grep RUNNING | awk '{print $5}' | xargs -I ip curl -v http://ip:32013 2>&1 | grep -A5 HTTP
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
> GET / HTTP/1.1
> Host: AAA.BBB.CCC.6:32013
> User-Agent: curl/7.43.0
> Accept: */*
> 
< HTTP/1.1 200 OK
< Server: nginx/1.11.4
< Date: Sat, 24 Sep 2016 19:40:00 GMT
< Content-Type: text/html
< Content-Length: 612
< Last-Modified: Tue, 13 Sep 2016 16:18:28 GMT
--
> GET / HTTP/1.1
> Host: AAA.BBB.CCC.7:32013
> User-Agent: curl/7.43.0
> Accept: */*
> 
< HTTP/1.1 200 OK
< Server: nginx/1.11.4
< Date: Sat, 24 Sep 2016 19:40:00 GMT
< Content-Type: text/html
< Content-Length: 612
< Last-Modified: Tue, 13 Sep 2016 16:18:28 GMT
--
> GET / HTTP/1.1
> Host: AAA.BBB.CCC.8:32013
> User-Agent: curl/7.43.0
> Accept: */*
> 
< HTTP/1.1 200 OK
< Server: nginx/1.11.4
< Date: Sat, 24 Sep 2016 19:40:00 GMT
< Content-Type: text/html
< Content-Length: 612
< Last-Modified: Tue, 13 Sep 2016 16:18:28 GMT
#+END_SRC


** NATS
  :properties:
  :header-args: :mkdirp true
  :end:

Creating a =Service= for =NATS= backed by a =Deployment= 
to which other running jobs can connect against.

*** Deployment

#+BEGIN_QUOTE
Create a Deployment to bring up a Replica Set and Pods.
#+END_QUOTE

Metadata (note that version is =extensions/v1beta1=)

#+BEGIN_SRC yaml :tangle files/deployments/nats.yaml
apiVersion: extensions/v1beta1
kind: Deployment
metadata:
  name: nats
  namespace: default
  labels:
    component: nats
#+END_SRC

Spec:

#+BEGIN_SRC yaml :tangle files/deployments/nats.yaml
# Deployment Spec and Template
spec:
  template:
    metadata:
      labels:
        component: nats
    spec:
      containers:
      - name: nats
        image: nats:0.9.4
        ports:
        - name: client
          containerPort: 4222
        - name: monitor
          containerPort: 8222
        resources:
          requests:
            cpu: 100m
            memory: 64Mi
#+END_SRC

*** Service

Metadata:

#+BEGIN_SRC yaml :tangle files/services/nats.yaml
apiVersion: v1
kind: Service
metadata:
  name: nats
  namespace: default
  labels:
    component: nats
#+END_SRC

Spec. Note that =clusterIP= is set to =None= in order to create a [[http://kubernetes.io/docs/user-guide/services/#headless-services][Headless service]].

#+BEGIN_SRC yaml :tangle files/services/nats.yaml
spec:
  selector:
    component: nats
  clusterIP: None
  ports:
  - name: client
    port: 4222
  - name: monitor
    port: 8222
#+END_SRC

*** Create the Deployment

#+BEGIN_SRC sh :results output code :exports both
kubectl create -f files/deployments/nats.yaml
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
deployment "nats" created
#+END_SRC

*** Create the Service

#+BEGIN_SRC sh :results output code :exports both
kubectl create -f files/services/nats.yaml
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
service "nats" created
#+END_SRC

*** Confirm deployment and service

#+BEGIN_SRC sh :results output :exports both
kubectl get --namespace default deployments,svc,pods -o wide
#+END_SRC

#+RESULTS:
#+begin_example
NAME                     DESIRED       CURRENT       UP-TO-DATE          AVAILABLE   AGE
nats                     1             1             1                   1           13m
nginx                    3             3             3                   3           2d
NAME                     CLUSTER-IP    EXTERNAL-IP   PORT(S)             AGE         SELECTOR
kubernetes               10.32.0.1     <none>        443/TCP             12d         <none>
nats                     None          <none>        4222/TCP,8222/TCP   1m          component=nats
nginx                    10.32.0.209   <nodes>       80/TCP              1d          run=nginx
NAME                     READY         STATUS        RESTARTS            AGE         IP           NODE
nats-3702806322-loqqt    1/1           Running       0                   13m         10.200.1.3   worker1
nginx-2032906785-2esi5   1/1           Running       0                   2d          10.200.2.3   worker2
nginx-2032906785-q3rk3   1/1           Running       0                   2d          10.200.1.2   worker1
nginx-2032906785-zdaob   1/1           Running       0                   2d          10.200.0.3   worker0
#+end_example

*** Confirm DNS is working

We will create a =busybox= container and confirm that we can resolve
the service we have just created and then try to connect to it:

#+BEGIN_SRC sh :results output
kubectl run -i --tty busybox --image=busybox --generator="run-pod/v1" --namespace=default
#+END_SRC

Then from within the =busybox= container, confirm =resolv.conf=

#+BEGIN_SRC sh
cat /etc/resolv.conf
search default.svc.cluster.local svc.cluster.local cluster.local google.internal
nameserver 10.32.0.10
options ndots:5
#+END_SRC

Try to make resolv the =nats=, (todo: works but takes a bit of time?)

#+BEGIN_SRC sh
nslookup nats
Server:    10.32.0.10
Address 1: 10.32.0.10 kube-dns.kube-system.svc.cluster.local
Name:      nats
Address 1: 10.200.1.3
#+END_SRC

Confirm we can connect into the container:

#+BEGIN_SRC sh
telnet 10.200.1.3 4222
INFO {"server_id":"ISY5lzBtDq6gpb4vxDaLVM","version":"0.9.4","go":"go1.6.3","host":"0.0.0.0","port":4222,"auth_required":false,"ssl_required":false,"tls_required":false,"tls_verify":false,"max_payload":1048576} 
sub hello 90
+OK
pub hello 5
world
+OK
MSG hello 90 5
world
#+END_SRC
